In [1]:
import pandas as pd

In [2]:
data_one = {'A': ["A1", "A2", "A3"],
            'B': ["B1", "B2", "B3"],
}
data_two = { 'C': ["C1", "C2", "C3"],
             'D': ["D1", "D2", "D3"],
}

In [3]:
df_one = pd.DataFrame(data_one)
df_two = pd.DataFrame(data_two)

In [4]:
df_one

    A   B
0  A1  B1
1  A2  B2
2  A3  B3

In [5]:
df_two

    C   D
0  C1  D1
1  C2  D2
2  C3  D3

In [10]:
abcd = pd.concat([df_one, df_two], axis=0)
abcd

     A    B    C    D
0   A1   B1  NaN  NaN
1   A2   B2  NaN  NaN
2   A3   B3  NaN  NaN
0  NaN  NaN   C1   D1
1  NaN  NaN   C2   D2
2  NaN  NaN   C3   D3

In [15]:
abcd2 = pd.concat([df_one.T, df_two.T], axis=0)
abcd2

    0   1   2
A  A1  A2  A3
B  B1  B2  B3
C  C1  C2  C3
D  D1  D2  D3

In [30]:
## 
registration = pd.DataFrame({
    'StudentID': [4, 2, 3, 1, 5],
    'Course': ['Math', 'Science', 'History', 'English', 'Music']
})

Fee_status = pd.DataFrame({
    'StudentID': [1, 2, 3, 4],
    'Fee_Paid': [True, False, True, False]
})

In [31]:
registration

   StudentID   Course
0          4     Math
1          2  Science
2          3  History
3          1  English
4          5    Music

In [32]:
Fee_status

   StudentID  Fee_Paid
0          1      True
1          2     False
2          3      True
3          4     False

In [33]:
pd.concat([registration, Fee_status], axis=1)

   StudentID   Course  StudentID Fee_Paid
0          4     Math        1.0     True
1          2  Science        2.0    False
2          3  History        3.0     True
3          1  English        4.0    False
4          5    Music        NaN      NaN

In [ ]:
registration.merge(Fee_status, on='StudentID', how='left') # left means keep all records from left table

   StudentID   Course Fee_Paid
0          4     Math    False
1          2  Science    False
2          3  History     True
3          1  English     True
4          5    Music      NaN

In [ ]:
registration.merge(Fee_status, on='StudentID', how='right') # right means keep all records from right table

   StudentID   Course  Fee_Paid
0          1  English      True
1          2  Science     False
2          3  History      True
3          4     Math     False

In [ ]:
registration.merge(Fee_status, on='StudentID', how='inner') # inner means keep only matching records

   StudentID   Course  Fee_Paid
0          4     Math     False
1          2  Science     False
2          3  History      True
3          1  English      True

In [ ]:
registration.merge(Fee_status, on='StudentID', how='outer') # outer means keep all records

   StudentID   Course Fee_Paid
0          1  English     True
1          2  Science    False
2          3  History     True
3          4     Math    False
4          5    Music      NaN